<!DOCTYPE html>
<html lang="es">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="./css/mobile.css" media="screen and (min-width:320px)"/>
    <!--<link rel="stylesheet" href="./css/mobileM.css" media="screen and (min-width:375px)"/>-->
    
    <title>Curriculum Vitae - José Mauricio Conto Albán</title>
</head>
<body>
    <header>
        <nav>
        <ul class="cabecera">
            <li class="nombre">
                <p id="Mauricio">Jos&eacute; Mauricio Conto Alb&aacute;n</p>
                <p class="celular"> Celular +57 320 824 90 75</p>
                <p class="correo"> mconto@gmail.com</p>
            </li>
            <li class="foto"><img src="./imgs/FotoMauricioConto.jpeg" alt="Foto de perfil"></img>
            </li>
        </ul>
        </nav>
    </header>
    <main>
        
        <hr class="div1">
        <div class="profesion"><span>Ingeniero Mecatr&oacute;nico</span></div>
        <hr class="div2"><br>
        <div class="descripcion-perfil">
        <p>Perfil profesional</p>
        <p>Experiencia como desarrollador con amplias competencias en el manejo de lenguajes de programaci&oacute;n de alto nivel y desarrollo de soluciones en Java, JEE, SQL, HTML y CSS, manejo de Git y GitHub y comandos en terminal linux. Experiencia en &aacute;rea comercial y de servicio al cliente, realizando acompañamiento y asesor&iacute;a en soluciones de tecnolog&iacute;a a nivel de software y hardware, video-vigilancia y seguridad, as&iacute; como liderando equipos de ventas. Dominio intermedio del idioma ingl&eacute;s. Profesional con habilidades de negociaci&oacute;n, orientaci&oacute;n al cliente y al detalle, propositivo, emprendedor y con enfoque al logro de objetivos. Inter&eacute;s laboral orientado a desempeñarse en &aacute;reas de desarrollo y soluciones de TI, big data y ventas t&eacute;cnicas.</p></div>
</div>
<hr class="divisoria0">
<div class="programador">
    <div class="experiencia">
        <p class="titulo-exp">
            PROGRAMADOR BACKEND | 3 años
        </p>
        <p class="descripcion-exp">
            Desarrollo de aplicativos web haciendo uso de Java 8.0 JEE, poniendo en pr&aacute;ctica fundamentos de programaci&oacute;n, programaci&oacute;n orientada a objetos, EL, JSTL,  Spring y  MySQL.
        </p>
        <img src="./imgs/prompt.png" alt="imagen decorativa de prompt shell">
    </div>
    

    <div class="proyectos">
        <div class="proyecto1">
        <p class="titulo-proyecto">
            Tienda avanzada para PYMES
        </p>
        <p class="descripcion-proyecto">
            Diseño de la arquitectura e implementaci&oacute;n de una tienda en l&iacute;nea personalizable con enfoque en seguridad (autenticaci&oacute;n y autorizaci&oacute;n), extensibilidad (nuevos tipos de producto y pasarelas de pago) y comprobabilidad (pruebas unitarias y de integraci&oacute;n). Arquitectura est&aacute;ndar con capa de persistencia de datos y consola de administraci&oacute;n y an&aacute;lisis de negocio con el objetivo de reducir fricci&oacute;n entre el vendedor y sus clientes.<br><a href="https://github.com/mconto/CarritoJSP">Ver repositorio</a>
        </p>
        </div>
        <div class="proyecto2">
            <p class="titulo-proyecto">
                Portal de gesti&oacute;n matrimonial
            </p>
            <p class="descripcion-proyecto2">
                Diseño de portal con espacial enfoque en retroalimentar por parte delos invitados la información memorable de la boda, como fotos ymensajes. Aplicando inyección de código en SQL a partir de Java, concontrol de insersión y automatización de galería con el fin de realizarun despliegue de datos de forma estructurada.
                <br><a href="https://github.com/mconto/MemorialBoda">Ver repositorio</a>
            </p>
        </div>
    </div>
</div>
<hr class="divisoria1">
<div class="desarrollador-it">
    <div class="experiencia1">
        <p class="titulo-exp1">
            DESARROLLADOR TI <br> Academia Colombiana de Genealogía <br> octubre 2019 - enero 2021
        </p>
        <p class="descripcion-exp1">
            Responsable del proceso de sistematización de una biblioteca con potencial de agilizar las investigaciones, liderando la automatización de un motor de consultas relacionadas con más de 100Gb de información.
        </p>

    </div>
    <div class="especificacion">
        <div class="funciones">
            <p class="desempeno">
                Metodolog&iacute;a de trabajo
            </p>
            <p class="detalles-motor">
            Se realiz&oacute; una integraci&oacute;n de tres plataformas, Google Drive, Airtable y entorno web, con lo cual se consigui&oacute; triangular la informaci&oacute;n, partiendo de la web, en donde se visualizaban bases de datos construidas mediante algoritmos de codificaci&oacute;n de informaci&oacute;n y se redireccionaba el flujo hacia Google Drive en donde la informaci&oacute;n era alojada y sincronizada con automatizaci&oacute;n en el nombramiento de archivos, codificaci&oacute;n haciendo uso de Macros y extracci&oacute;n de vinculos mediante Google Script con el fin de automatizar las tareas de elaboraci&oacute;n en un sistema robusto.
            <br>
            Adicional al trabajo en &aacute;rea de tecnolog&iacute;a y desarrollo, trabaj&eacute; en el sector comercial, prestando servicio al cliente ofreciendo informaci&oacute;n referente a los procesos de nacionalidad y obtenci&oacute;n de pasaporte europeo para la Academia Colombiana de Genealog&iacute;a.
            </p>
        </div>
    </div>
</div>


<hr class="divisoria2">


<div class="asesor-comercial">
    <div class="experiencia2">
        <p class="titulo-exp2">
            ASESOR COMERCIAL <br> Independiente <br> marzo 2019 - presente
        </p>
        <p class="descripcion-exp2">
            Realizar acompañamiento y seguimiento a las solicitudes para la obtenci&oacute;n de nacionalidad europea, liderando un equipo de 3 profesionales para el desarrollo de los procesos logrando la gesti&oacute;n de alrededor de 40-50 procesos exitosos entre España y Portugal.
        </p>

    </div>
    <div class="especificacion1">
        <div class="funciones1">
            <p class="desempeno1">
                Metodolog&iacute;a de trabajo
            </p>
            <p class="detalles-asesor">
            El gobierno español y portugu&eacute;s emitieron una ley en la que otorgar&iacute;an nacionalidad europea a quienes demuestren ser descendientes de un sefard&iacute; expulsado de la pen&iacute;nsula ib&eacute;rica, para esto se deben presentar pruebas documentales y documentos personales probatorios. 
            <br><br>
            Mi funci&oacute;n consiste en liderar la preventa, el proceso recorrido en etapa uno y el empalme con firma de abogados, liderando a los grupos frente al proceso que se desarrolla en la firma y canalizando las solicitudes, inquietudes y consultas durante el transcurrir de la nacionalidad europea. Asesor&iacute;a permantente durante las 4 etapas del proceso. Resultados 100% efectivos y comprobables. 
            </p>
        </div>
    </div>
</div>


<hr class="divisoria3">


<div class="lider-proyectos">
    <div class="experiencia3">
        <p class="titulo-exp3">
            INGENIERO DE IDEAS <br> Imotik <br> septiembre 2015 - presente
        </p>
        <p class="descripcion-exp3">
            Consultor en el diseño de soluciones de video-vigilancia y a personas o propiedades que requieren sistemas de seguridad. Realizando an&aacute;lisis de las necesidades del cliente o usuario, diseño y presentaci&oacute;n de propuestas, implementaci&oacute;n, instalaci&oacute;n y puesta en marcha, as&iacute; como dar soporte postventa. Configuraci&oacute;n, montaje de sistemas operativos y otros programas de trabajo diario. Actualmente logro la certificaci&oacute;n de Hikvision como ingeniero de seguridad y soluci&oacute;n efectiva de problemas de rendimiento en equipos de capacidad reducida.
        </p>

    </div>
    <div class="especificacion2">
        <div class="funciones2">
            <p class="desempeno2">
                Metodolog&iacute;a de trabajo
            </p>
            <p class="detalles-lider">
            Personas con limitaciones f&iacute;sicas presentan dificultades para realizar tareas b&aacute;sicas como el encendido de una bombilla en la habitaci&oacute;n o poner m&uacute;sica,generando frustraci&oacute;n por no poder realizar tareas elementales, afectando su autopersepci&oacute;n y autoestima. A trav&eacute;s de sistemas dom&oacute;ticos es posible implementar soluciones que habilitan a miembros de tercera edad o con limitaciones sensoriales a realizar estas tareas.
            <br><br>
            El usuario com&uacute;n de computadores de escritorio o portatiles Windows presentan recurrentes problemas de rendimiento por falta de mantenimiento preventivo y correctivo del sistema. Las soluciones ofrecidas consisten en la potencializaci&oacute;n de los equipos ya adquiridos con el fin de sacar máximo provecho al hardware sin necesidad de adquirir computadores nuevos, ya que los costos son significantes y el ahorro hoy en d&iacute; a es una necesidad.
            </p>
        </div>
    </div>
</div>


<hr class="divisoria4">


<div class="css">
    <div class="experiencia4">
        <p class="titulo-exp4">
            CONSULTOR DE SEGURIDAD <br> CSS Latinoamerica <br> diciembre 2012 - junio 2013
        </p>
        <p class="descripcion-exp4">
            Realización de pruebas de penetraci&oacute;n, generaci&oacute;n de informes de seguridad informatica sugiriendo correctivos de seguridad a los equipos y dispositivos de red. Manejo de consola appliance automatizadora de escaneo de vulnerabilidades determinando el nivel de riesgo en cada una de ellas.
        </p>

    </div>
    <div class="especificacion3">
        <div class="funciones3">
            <p class="desempeno3">
                Metodolog&iacute;a de trabajo
            </p>
            <p class="detalles-css">
            Realización de ataques de penetraci&oacute;n a redes y bases de datos de sistemas bancarios, presentando metodolog&iacute;a de investigaci&oacute;n de fallos a trav&eacute;s de equipos (hardware) especial para detectar vulnerabilidades y programar tareas de escaneo de debilidades, generación de informes con posibles soluciones.
            <br>
            
            </p>
        </div>
    </div>
</div>

<hr class="divisoria5">

<div class="habilidades-educacion">
    <div class="habilidades">
        <span class="titulo-habilidades">HABILIDADES</span>
        <ul class="habilidades1">
            <li>Negociaci&oacute;n</li>
            <li>Orientaci&oacute;n al cliente y al detalle</li>
            <li>Propositivo</li>
            <li>Enfoque al logro de objetivos</li>
        </ul>
        <ul class="habilidades2">
            <li>Macros VBA Excel</li>
            <li>Java</li>
            <li>Spring</li>
            <li>SQL</li>
            <li>HTML</li>
            <li>CSS</li>
            <li>Git y GitHub</li>
        </ul>
    </div>
    <div class="educacion">
        <span class="titulo-educacion">EDUCACI&Oacute;N</span>
        <ul>
            <li>UNIVERSIDAD DE SAN BUENAVENTURA. <br>Ingenier&iacute;a mecatr&oacute;nica. <br>Proyecto de grado: Diseño y construcci&oacute;n de m&aacute;quina <br>extrusora de filamentos ABS y PLA para impresora 3D.</li>
        </ul>
        <ul class="educacion1">
            <li>Terminal y l&iacute;nea de comandos en linux</li>
            <li>Flujo de desarrollo moderno con CodeStream</li>
            <li>Desarrollo pr&aacute;ctico en HTML y CSS</li>
            <li>Curso definitivo de HTML y CSS</li>
            <li>Curso profesional en Git y GitHub</li>
            <li>Ingeniero de seguridad - Hikvision</li>
            <li>Programaci&oacute;n en C++</li>
            <li>Fundamentos de programaci&oacute;n en Java</li>
            <li>Programaci&oacute;n orientada a objetos en Java</li>
            <li>Java Enterprise Edition (Anotaciones)</li>
            <li>Desarrollo de macros en Excel con VBA</li>
            <li>Diseño de producto en 3D avanzado con Rhinoceros</li>
            <li>Liderazgo cr&iacute;tico - Lifespring International</li>
            
        </ul>
    </div>
</div>

    </main>
    <footer>
    <p> Diseñada por Jos&eacute; Mauricio Conto en su totalidad, implementando estilos propios y HTML, adaptado a diferentes tamaños de dispositivo, smartphone, tablet y computador escritorio (responsive design). <br>Este diseño NO corresponde a una plantilla descargada, al contrario es una creaci&oacute;n propia del autor de principio a fin.<br>
        Hace parte de los proyectos FRONTEND desarrollados.
    </p>
        
    </footer>
</body>
</html>