<!DOCTYPE html>
<html lang="es">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="./css/mobile.css" media="screen and (min-width:320px)"/>
    <!--<link rel="stylesheet" href="./css/mobileM.css" media="screen and (min-width:375px)"/>-->
    
    <title>Curriculum Vitae</title>
</head>
<body>
    <header>
        <nav>
        <ul class="cabecera">
            <li class="nombre">
                <p id="Mauricio">Jos&eacute; Mauricio Conto Alb&aacute;n</p>
                <p class="celular"> Celular 320 824 90 75</p>
                <p class="correo"> mconto@gmail.com</p>
            </li>
            <li class="foto"><img src="./imgs/FotoMauricioConto.jpeg" alt="Foto de perfil"></img>
            </li>
        </ul>
        </nav>
    </header>
    <main>
        
        <hr class="div1">
        <div class="profesion"><span>Ingeniero Mecatr&oacute;nico</span></div>
        <hr class="div2">
<div class="bloque-perfil">
        <div class="titulo-descripcion-perfil">Perfil profesional</div>
        <div class="descripcion-perfil"><br><p>Experiencia como desarrollador con amplias competencias en el manejo de lenguajes de programaci&oacute;n de alto nivel y desarrollo de soluciones en Java, JEE, servlets, SQL, HTML y CSS, manejo de Git y GitHub y comandos en terminal linux. Experiencia en &aacute;rea comercial y de servicio al cliente, realizando acompa単amiento y asesor&iacute;a en soluciones de tecnolog&iacute;a a nivel de software y hardware, video-vigilancia y seguridad, as&iacute; como liderando equipos de ventas. Dominio intermedio del idioma ingl&eacute;s. Profesional con habilidades de negociaci&oacute;n, orientaci&oacute;n al cliente y al detalle, propositivo, emprendedor y con enfoque al logro de objetivos. Inter&eacute;s laboral orientado a desempe単arse en &aacute;reas de desarrollo y soluciones de TI, big data y ventas t&eacute;cnicas.</p></div>
</div>

<div class="programador">
    <div class="experiencia">
        <p class="titulo-exp">
            PROGRAMADOR | 3 a単os
        </p>
        <p class="descripcion-exp">
            Desarrollo de aplicativos web haciendo uso de Java 8.0 JEE, poniendo en pr&aacute;ctica fundamentos de programaci&oacute;n, programaci&oacute;n orientada a objetos, EL, JSTL,  Spring, MySQL, HTML 5.0, CSS y responsive design.
        </p>
    </div>
    <div class="proyectos">
        <p class="titulo-proyecto">
            Tienda avanzada para PYMES
        </p>
        <p class="descripcion-proyecto">
            Dise単o de la arquitectura e implementaci&oacute;n de una tienda en l&iacute;nea personalizable con enfoque en seguridad (autenticaci&oacute;n y autorizaci&oacute;n), extensibilidad (nuevos tipos de producto y pasarelas de pago) y comprobabilidad (pruebas unitarias y de integraci&oacute;n). Arquitectura est&aacute;ndar con capa de persistencia de datos y consola de administraci&oacute;n y an&aacute;lisis de negocio con el objetivo de reducir fricci&oacute;n entre el vendedor y sus clientes.<br><a href="https://github.com/mconto/CarritoJSP">Ver repositorio</a>
        </p>
    </div>
</div>
    </main>
</body>
</html>