<!DOCTYPE html>
<html lang="es">
  <head>
    <meta charset="UTF-8" />
    <meta http-equiv="X-UA-Compatible" content="IE=edge" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <link rel="stylesheet" href="./css/mobileopinion.css" />
    <title>Opiniones - Jos&eacute; Mauricio Conto Alb&aacute;n</title>
  </head>
  <body>
    <main>
      <div class="opinion-css">
        <p>CSS Y HTML S&Iacute; PERO NO AS&Iacute;</p>
        
        <p>
          Abundan en redes las discusiones sin final acerca de CSS y HTML,
          muchos diciendo que no son lenguajes de programaci&oacute;n, con sus
          argumentos muy v&aacute;lidos, otros diciendo que saben programar
          p&aacute;ginas web por implementar una hoja de estilos y haciendo uso
          de un lenguaje de marcado. <br><br>
          
          Creo que el origen de esta discusi&oacute;n
          radica en la subvaloraci&oacute;n del ejercicio de estilizar una
          p&aacute;gina web mientras se programan algoritmos complejos de
          consulta y calculo de informaci&oacute;n y datos haciendo uso de
          herramientas y lenguajes de programaci&oacute;n combinados. Al
          panadero se le reconoce por hacer pan. <br><br>
          
          Si bien es muy claro que
          realizar procesos algoritmicos, uso de variables, sentencias de
          control, anotaciones, un debug paso por paso de una secuencia de
          instrucciones, esta tarea pierde total validez si el usuario que
          visita la p&aacute;gina no encuentra un estilo llamativo, no encuentra
          un orden y una elegancia que invite y conecte al usuario con toda esa
          l&oacute;gica interna. <br><br>
          
          En el mundo de la informaci&oacute;n,
          programaci&oacute;n y hacking, surgen diferentes conceptos de lo que
          es hackear un sistema, la actitud hacker, la l&oacute;gica del hacker.
          Este es un concepto que se reconstruye d&iacute;a a d&iacute;a, que va
          m&aacute;s all&aacute; de entrar en otro sistema a trav&eacute;s de
          una red. <br><br>
          
          Cuando hablan dos personas y se hace entender una idea que
          inicialmente s&oacute;lo uno de los dos conoce, se puede hablar de un
          hackeo cognitivo, sobre todo cuando el entendimiento del concepto
          requiere un esfuerzo intelectual para hacer entender al oyente.
          Siguiendo la idea, cuando a trav&eacute;s de un lenguaje de marcado y
          hojas de estilo se diseña una página y logramos hackear la atención de
          un usuario, ¿Somos hackers?En ese sentido s&iacute;, y somos
          programadores. ¿Por qu&eacute;? Porque un programador sigue una
          secuencia l&oacute;gica, implementa una metodolog&iacute;a de diseño y
          toma decisiones basado en lo que es correcto para ser insertado y el
          flujo de informaci&oacute;n concluya de manera exitosa. Volviendo al
          lenguaje de marcado y hojas de estilo, cuando se implementa de la
          manera correcta (REALMENTE PERSUASIVA), y ac&aacute; se considera la
          l&oacute;gica del consumo, el usuario hace clic con la p&aacute;gina y
          finalmente COMPRA. Esto en t&eacute;rminos abstractos y
          filos&oacute;ficos. <br><br>
          
          Hoy en d&iacute;a esto es demostrable con ciencia
          de datos, usada en lanzamientos de productos, por ejemplo.
          Tambi&eacute;n podr&iacute;a haber un an&aacute;lisis de interacciones
          basado en los estilos de la p&aacute;gina, el tama&ntilde;o de fuente,
          color, negrita, margenes...todo entra por los ojos, según como se
          presente. <br><br>
          
          El problema de atribuirse como programador de p&aacute;ginas
          web siendo un implementador de lenguaje de marcado y hojas de estilo
          est&aacute; en que no se realice la labor de forma completa y
          contundente, que no se profundice en el estilo ideal para vender
          m&aacute;s, sino que simplemente se inserte una p&aacute;gina bonita
          (como la m&iacute;a :D). <br><br>
          
          De esta manera me parece posible acercar la
          dos posturas, tanto la del desarrollador avanzado como la del
          dise&ntilde;ador web, invitando a que se retroalimente la charla con
          la puerta abierta para entrar en el paraiso de la l&oacute;gica del
          consumo, y as&iacute; poder hablar de una programaci&oacute;n al
          consumo.
        </p>
      </div>
    </main>
  </body>
</html>
